Конфигурация/Enums/ГлавыПланаСчетовНФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ГлавыПланаСчетовНФО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлаваА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлаваБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлаваВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлаваГ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/ChartsOfAccounts/Единый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfAccounts>
		<Properties>
			<Name>Единый</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлаваПланаСчетовНФО</Name>
					<Comment>Глава плана счетов некредитных финансовых организацй</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ГлавыПланаСчетовНФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Конфигурация/ChartsOfAccounts/Основной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfAccounts>
		<Properties>
			<Name>Основной</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСРегистрамиБухгалтерии/Ext/Module.bsl
Процедура ПроверитьКорректностьПроводок(НаборПроводок, Отказ) Экспорт
	
	СворачиватьПарныеСчетаКорректировокПутемПереброски = Неопределено;
	
	Регистратор = НаборПроводок.Отбор.Регистратор.Значение;
	
	ЭтоЕПС = (ТипЗнч(НаборПроводок) = Тип("РегистрБухгалтерииНаборЗаписей.ЕдиныйБухгалтерскийУчет"));
	ЭтоРСБУ = (ТипЗнч(НаборПроводок) = Тип("РегистрБухгалтерииНаборЗаписей.БухгалтерскийУчет"));
	
	ДтКт = Новый Массив;
	ДтКт.Добавить(Новый Структура("Постфикс, ОбратныйПостфикс, Описание", "Дт", "Кт", "дебет"));
	ДтКт.Добавить(Новый Структура("Постфикс, ОбратныйПостфикс, Описание", "Кт", "Дт", "кредит"));
	
	МассивСчетовПартииЕПС = Новый Массив();
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДобавочныйКапитал);
	МассивСчетовПартииЕПС.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	
	МассивСчетовДоходыРасходыЕПС = Новый Массив();
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ПрибыльУбытокПрошлогоГода);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ПроцентныеРасходы);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоРезервам);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.НалогНаПрибыль);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ПроцентныеДоходыПрошлогоГода);
	МассивСчетовДоходыРасходыЕПС.Добавить(ПланыСчетов.Единый.ДоходыИРасходыКромеПроцентныхОтОперацийСФинансовымиИнструментамиПрошлогоГода);
		
	МассивСчетовДоходыРасходыРСБУ_НУ = Новый Массив;
	МассивСчетовДоходыРасходыРСБУ_НУ.Добавить(ПланыСчетов.Основной.ПрочиеДоходы);
	МассивСчетовДоходыРасходыРСБУ_НУ.Добавить(ПланыСчетов.Основной.ПрочиеРасходы);
	МассивСчетовДоходыРасходыРСБУ_НУ.Добавить(ПланыСчетов.Основной.СебестоимостьПродажи);
	МассивСчетовДоходыРасходыРСБУ_НУ.Добавить(ПланыСчетов.Основной.Выручка);
		
	МассивОшибок = Новый Массив();
	
	Для НомерПроводки = 0 По НаборПроводок.Количество() - 1 Цикл
		
		Проводка = НаборПроводок[НомерПроводки];
		
		Для каждого СтрокаДтКт Из ДтКт Цикл
			
			ТекДтКт = СтрокаДтКт.Постфикс;
			КорДтКт = СтрокаДтКт.ОбратныйПостфикс;
			
			ТекСчет = БухгалтерскийУчетПовтИсп.РеквизитыСчета(Проводка["Счет" + ТекДтКт]);
			КорСчет = БухгалтерскийУчетПовтИсп.РеквизитыСчета(Проводка["Счет" + КорДтКт]);
			
			Валюта = Проводка["Валюта" + ТекДтКт];
			Количество = Проводка["Количество" + ТекДтКт];
			Субконто = Проводка["Субконто" + ТекДтКт];
			ЗначенияСубконто = Новый Структура("Субконто1, Субконто2, Субконто3", Неопределено, Неопределено, Неопределено);
			
			ОписаниеПроводки = СтрШаблон("Проводка №%1, '%2', на сумму %3 руб, %4", НомерПроводки + 1, Проводка.Содержание, Проводка.Сумма, СтрокаДтКт.Описание);
			
			Если Не ЗначениеЗаполнено(ТекСчет.Ссылка) Тогда
				
				НормальнаяСитуация = (ЗначениеЗаполнено(КорСчет.Ссылка) И КорСчет.Забалансовый); // счет может быть незаполнен только в случае если корсчет забалансовый
				Если Не НормальнаяСитуация Тогда
					МассивОшибок.Добавить(ОписаниеПроводки + ": " + "не заполнен счет");
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если БухгалтерскийУчет.СчетЯвляетсяГруппой(ТекСчет.Ссылка) Тогда // запрещены проводки по счетам, явл. группами
				МассивОшибок.Добавить(ОписаниеПроводки + ": " + ТекСчет.Код + " является группой");
			КонецЕсли;
			
			Если ТекСчет.Валютный И Не ЗначениеЗаполнено(Валюта) Тогда // валюта по валютным счетам должна быть заполнена
				МассивОшибок.Добавить(ОписаниеПроводки + ": " + "не заполнена валюта по счету " + ТекСчет.Код);
			ИначеЕсли НЕ ТекСчет.Валютный И ЗначениеЗаполнено(Валюта) Тогда // а по не валютным - не должна
				МассивОшибок.Добавить(ОписаниеПроводки + ": " + "заполнена валюта по счету " + ТекСчет.Код);
			КонецЕсли;
			
			Если Не ТекСчет.Количественный И Количество <> 0 И Количество <> Null Тогда // кол-во м.б. заполнено только по количественным счетам
				МассивОшибок.Добавить(ОписаниеПроводки + ": " + "заполнено количество по счету" + ТекСчет.Код);
			КонецЕсли;
			
			// проверим заполнение субконто
			Для каждого СтрокаВидыСубконто Из ТекСчет.ВидыСубконто Цикл
				
				ЗначениеСубконто = Субконто[СтрокаВидыСубконто.ВидСубконто];
				
				Если НЕ ЗначениеЗаполнено(ЗначениеСубконто) Тогда
				
					ПроверятьЗаполнениеСубконто = НЕ РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(Регистратор.Организация, ТекСчет.Ссылка, СтрокаВидыСубконто.ВидСубконто, Регистратор.Дата);
					Если ПроверятьЗаполнениеСубконто Тогда
						МассивОшибок.Добавить(ОписаниеПроводки + ": " + "не заполнено субконто " + СтрокаВидыСубконто.ВидСубконто);
					Иначе
						Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто] = РаботаСМетаданнымиПовтИсп.ПолучитьПустоеЗначениеСубконто(СтрокаВидыСубконто.ВидСубконто); 
					КонецЕсли;
									
				КонецЕсли;
				
				ЗначенияСубконто.Вставить("Субконто" + Строка(СтрокаВидыСубконто.НомерСтроки), ЗначениеСубконто); 
				
			КонецЦикла;
			
			Если ЭтоЕПС Тогда
				
				Если МассивСчетовДоходыРасходыЕПС.Найти(ТекСчет.Родитель) <> Неопределено 
					И КорСчет.Ссылка = ПланыСчетов.Единый.АктивыВДУ03
					И Проводка["ДополнительнаяАналитика" + КорДтКт] = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаБезОтнесенияНаФинРез Тогда
				
					МассивОшибок.Добавить(ОписаниеПроводки + ": " + "счет 47903(Переоценка при реорганизации ЦБ без финрезультата) не может корреспондировать с седьмым разделом");
				
				КонецЕсли;
				
				// заполнение лицевых счетов
				Если МассивОшибок.Количество() = 0 И НЕ ТекСчет.Ссылка = ПланыСчетов.Единый.Вспомогательный Тогда
				
					ТребуютсяПартииНаЛицевых = (МассивСчетовПартииЕПС.Найти(ТекСчет.Родитель) <> Неопределено);
						
					// #473904 - извраты от СНГ
					// СНГ настоял на своей схеме закрытия парных счетов корректировок ЭСП, причем они ведут учет партий на лицевых счетах
					// но, как признались в фонде, они не смогли реализовать учет партий на счетах доходов/расходов от корректировок
					// из-за этого пришлось нам сделать для них такую затыку: везде партии на лицевых есть, а на 71005/71006 - нет
					Если ТекСчет.Ссылка = ПланыСчетов.Единый.ПроцентныеДоходы05 ИЛИ ТекСчет.Ссылка = ПланыСчетов.Единый.ПроцентныеДоходы06 Тогда
						
						Если СворачиватьПарныеСчетаКорректировокПутемПереброски = Неопределено Тогда
							СворачиватьПарныеСчетаКорректировокПутемПереброски = БухгалтерскийУчет.ОпределитьНастройкуУчета(
								Проводка.Период,
								Проводка.Организация,
								Проводка.СчетДоверительногоУправления,
								"СворачиватьПарныеСчетаКорректировокПутемПереброски");
						КонецЕсли;
						
						ТребуютсяПартииНаЛицевых = НЕ СворачиватьПарныеСчетаКорректировокПутемПереброски;
					
					КонецЕсли;
					
					// #530697 - для главы Г (и В) отражаем партии на забалансе для СВОПов
					Если НЕ ТребуютсяПартииНаЛицевых
						И (ТекСчет.ГлаваПланаСчетовНФО = Перечисления.ГлавыПланаСчетовНФО.ГлаваВ
							ИЛИ ТекСчет.ГлаваПланаСчетовНФО = Перечисления.ГлавыПланаСчетовНФО.ГлаваГ)
						И ЗначениеЗаполнено(Проводка.Партия) Тогда
					
						ТребуютсяПартииНаЛицевых = Истина;	
					
					КонецЕсли;
					
					Проводка["ЛицевойСчет" + ТекДтКт] = БухгалтерскийУчетПовтИсп.ПолучитьЛицевойСчет(
						ТекСчет.Ссылка,
						?(ТекСчет.Валютный, Валюта, Проводка.Организация.ВалютаУчета),
						Проводка.Организация,
						Проводка.СчетДоверительногоУправления,
						ЗначенияСубконто.Субконто1,
						ЗначенияСубконто.Субконто2,
						ЗначенияСубконто.Субконто3,
						Проводка["ДополнительнаяАналитика" + ТекДтКт],
						?(ТребуютсяПартииНаЛицевых, Проводка.Партия, Неопределено),
						?(ТребуютсяПартииНаЛицевых, Проводка.СтрокаПартии, Неопределено));
				
				КонецЕсли;
			Иначе 		
				//Для РСБУ Обращается на ОРЦБ не заполняем. Для НУ не заполняем, если нет Ценной бумаги 
				Если (Регистратор.Дата) > Дата(2023, 1, 1)   //# техдолг. Надо почистить проводки до 2023 года.
					И МассивСчетовДоходыРасходыРСБУ_НУ.Найти(ТекСчет.Ссылка) <> Неопределено
					И ЗначениеЗаполнено(ЗначенияСубконто.Субконто3) Тогда 
					// ЦенныйБумаги - субконто2, Обращается на ОРЦБ - Субконто3
					Если ЭтоРСБУ Тогда 
						МассивОшибок.Добавить(ОписаниеПроводки + ": " + " субконто ОбращаетсяНаОРЦБ не должно заполняться в РСБУ");							
					ИначеЕсли НЕ ЭтоРСБУ И НЕ ЗначениеЗаполнено(ЗначенияСубконто.Субконто2) Тогда 
						МассивОшибок.Добавить(ОписаниеПроводки + ": " + " субконто ОбращаетсяНаОРЦБ не должно заполнятся в НУ для незаполненного субконто ЦеннаяБумага");	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
		
		// когда в Партию пихнули пустую ссылку могут разойтись лицевые счета
		Если ЭтоЕПС 								// только ЕПС
			И Проводка.Период > '20240101'			// ранее 1.1.24 все исправлено
			И НЕ ЗначениеЗаполнено(Проводка.Партия) // Партия не заполнена
			И Проводка.Партия <> Неопределено Тогда	// но там не Неопределено, значит там пустая ссылка - исправляем
			
			Проводка.Партия = Неопределено;
			Проводка.СтрокаПартии = 0; // для гарантии
		КонецЕсли;
		
	КонецЦикла;
	
	Отказ = (МассивОшибок.Количество() > 0);
	
	Для каждого Ошибка Из МассивОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка, Регистратор);		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьКорректностьПроводок

Функция ДобавитьПроводку(Документ, НаборДвижений, Сумма, Содержание, ДанныеАналитики = Неопределено) Экспорт
	
	Движение = НаборДвижений.Добавить();
	
	Движение.Период                       = Документ.Дата;
	Движение.Организация                  = Документ.Организация;
	Движение.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(Документ.СчетДоверительногоУправления);
	Движение.Сумма                        = Сумма;
	Движение.Содержание                   = Содержание;

	Если      ТипЗнч(Документ) = Тип("ДокументОбъект.Сделка") Тогда
		Движение.ПорядокОпераций = Документ.НомерСделки;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
		Движение.ПорядокОпераций = Документ.Основание.НомерСделки;
	КонецЕсли;
	
	Если ДанныеАналитики <> Неопределено
		И (ТипЗнч(НаборДвижений) = Тип("РегистрБухгалтерииНаборЗаписей.БухгалтерскийУчет")
			ИЛИ ТипЗнч(НаборДвижений) = Тип("РегистрБухгалтерииНаборЗаписей.НалоговыйУчет")) Тогда
		Движение.ДополнительнаяАналитика = БухгалтерскийУчет.ПолучитьДополнительнуюАналитикуБухгалтерскогоУчета(Движение.Организация, ДанныеАналитики);
	КонецЕсли;
	
	Возврат Движение;
	
КонецФункции // ДобавитьПроводкуДокумента
